const std = @import("std");

// based on Google IME

// zig fmt: off
pub const TransliterationMap = std.StaticStringMap([]const u8).initComptime(.{
    .{ "a", "あ" },
    .{ "i", "い" },
    .{ "u", "う" },
    .{ "e", "え" },
    .{ "o", "お" },

    .{ "ka", "か" },
    .{ "ki", "き" },
    .{ "ku", "く" },
    .{ "ke", "け" },
    .{ "ko", "こ" },

    .{ "sa", "さ" },
    .{ "si", "し" },
    .{ "su", "す" },
    .{ "se", "せ" },
    .{ "so", "そ" },

    .{ "ta", "た" },
    .{ "ti", "ち" },
    .{ "tu", "つ" },
    .{ "te", "て" },
    .{ "to", "と" },

    .{ "na", "な" },
    .{ "ni", "に" },
    .{ "nu", "ぬ" },
    .{ "ne", "ね" },
    .{ "no", "の" },

    .{ "ha", "は" },
    .{ "hi", "ひ" },
    .{ "fu", "ふ" },
    .{ "he", "へ" },
    .{ "ho", "ほ" },

    .{ "ma", "ま" },
    .{ "mi", "み" },
    .{ "mu", "む" },
    .{ "me", "め" },
    .{ "mo", "も" },

    .{ "ya", "や" },
    .{ "yu", "ゆ" },
    .{ "yo", "よ" },

    .{ "ra", "ら" },
    .{ "ri", "り" },
    .{ "ru", "る" },
    .{ "re", "れ" },
    .{ "ro", "ろ" },

    .{ "wa", "わ" },
    .{ "wo", "を" },
    .{ "n", "ん" },

    // Voiced consonants
    .{ "ga", "が" },
    .{ "gi", "ぎ" },
    .{ "gu", "ぐ" },
    .{ "ge", "げ" },
    .{ "go", "ご" },

    .{ "za", "ざ" },
    .{ "zi", "じ" },
    .{ "zu", "ず" },
    .{ "ze", "ぜ" },
    .{ "zo", "ぞ" },

    .{ "da", "だ" },
    .{ "di", "ぢ" },
    .{ "du", "づ" },
    .{ "de", "で" },
    .{ "do", "ど" },

    .{ "ba", "ば" },
    .{ "bi", "び" },
    .{ "bu", "ぶ" },
    .{ "be", "べ" },
    .{ "bo", "ぼ" },

    .{ "pa", "ぱ" },
    .{ "pi", "ぴ" },
    .{ "pu", "ぷ" },
    .{ "pe", "ぺ" },
    .{ "po", "ぽ" },

    // Palatalized sounds
    .{ "kya", "きゃ" },
    .{ "kyi", "きぃ"},
    .{ "kyu", "きゅ" },
    .{ "kye", "きぇ" },
    .{ "kyo", "きょ" },

    .{ "nya", "にゃ" },
    .{ "nyi", "にぃ" },
    .{ "nyu", "にゅ" },
    .{ "nye", "にぇ" },
    .{ "nyo", "にょ" },

    .{ "hya", "ひゃ" },
    .{ "hyi", "ひぃ" },
    .{ "hyu", "ひゅ" },
    .{ "hye", "ひぇ" },
    .{ "hyo", "ひょ" },

    .{ "mya", "みゃ" },
    .{ "myi", "みぃ" },
    .{ "myu", "みゅ" },
    .{ "mye", "みぇ" },
    .{ "myo", "みょ" },

    .{ "rya", "りゃ" },
    .{ "ryi", "りぃ" },
    .{ "ryu", "りゅ" },
    .{ "rye", "りぇ" },
    .{ "ryo", "りょ" },

    .{ "tya", "ちゃ" },
    .{ "tyi", "ちぃ" },
    .{ "tyu", "ちゅ" },
    .{ "tye", "ちぇ" },
    .{ "tyo", "ちょ" },

    .{ "cya", "ちゃ" },
    .{ "cyi", "ちぃ" },
    .{ "cyu", "ちゅ" },
    .{ "cye", "ちぇ" },
    .{ "cyo", "ちょ" },
    
    .{ "pya", "ぴゃ" },
    .{ "pyi", "ぴぃ" },
    .{ "pyu", "ぴゅ" },
    .{ "pye", "ぴぇ" },
    .{ "pyo", "ぴょ" },
    
    .{ "bya", "びゃ" },
    .{ "byi", "びぃ" },
    .{ "byu", "びゅ" },
    .{ "bye", "びぇ" },
    .{ "byo", "びょ" },

    // Other
    .{ "ye", "いぇ" },

    .{ "tsa", "つぁ" },
    .{ "tsi", "つぃ" },
    .{ "tsu", "つ" },
    .{ "tse", "つぇ" },
    .{ "tso", "つぉ" },

    .{ "cha", "ちゃ" },
    .{ "chi", "ち" },
    .{ "chu", "ちゅ" },
    .{ "che", "ちぇ" },
    .{ "cho", "ちょ" },

    .{ "sha", "しゃ" },
    .{ "shi", "し" },
    .{ "shu", "しゅ" },
    .{ "she", "しぇ" },
    .{ "sho", "しょ" },

    .{ "qa", "くぁ" },
    .{ "qi", "くぃ" },
    .{ "qu", "く" },
    .{ "qe", "くぇ" },
    .{ "qo", "くぉ" },

    .{ "ja", "じゃ" },
    .{ "ji", "じ" },
    .{ "ju", "じゅ" },
    .{ "je", "じぇ" },
    .{ "jo", "じょ" },
});

pub const SmallTransliterationMap = std.StaticStringMap([]const u8).initComptime(.{
    .{ "tsu", "っ" },

    .{ "ke", "ヶ" },
    .{ "ka", "ヵ" },

    .{ "a", "ぁ" },
    .{ "i", "ぃ" },
    .{ "u", "ぅ" },
    .{ "e", "ぇ" },
    .{ "o", "ぉ" },

    .{ "ya", "ゃ" },
    .{ "yi", "ぃ" },
    .{ "yu", "ゅ" },
    .{ "ye", "ぇ" },
    .{ "yo", "ょ" },
});