const std = @import("std");

// based on Google IME

// zig fmt: off
pub const transliterables = std.StaticStringMap(void).initComptime(.{
    // vowels
    .{"a"}, .{"i"}, .{"u"}, .{"e"}, .{"o"},

    // consonants
    .{"k"}, .{"s"}, .{"t"}, .{"n"}, .{"h"}, .{"m"}, .{"y"}, 
    .{"r"}, .{"w"}, .{"g"}, .{"z"}, .{"d"}, .{"b"}, .{"p"}, 
    .{"n"}, .{"c"}, .{"q"}, .{"j"}, .{"v"},

    // small kana modifier
    .{"x"}, .{"l"}
});
// zig fmt: on

// zig fmt: off
pub const transliteration_map = std.StaticStringMap([]const u8).initComptime(.{
    .{ "a", "あ" },
    .{ "i", "い" },
    .{ "u", "う" },
    .{ "e", "え" },
    .{ "o", "お" },

    .{ "ka", "か" },
    .{ "ki", "き" },
    .{ "ku", "く" },
    .{ "ke", "け" },
    .{ "ko", "こ" },

    .{ "sa", "さ" },
    .{ "si", "し" },
    .{ "su", "す" },
    .{ "se", "せ" },
    .{ "so", "そ" },

    .{ "ta", "た" },
    .{ "ti", "ち" },
    .{ "tu", "つ" },
    .{ "te", "て" },
    .{ "to", "と" },

    .{ "na", "な" },
    .{ "ni", "に" },
    .{ "nu", "ぬ" },
    .{ "ne", "ね" },
    .{ "no", "の" },

    .{ "ha", "は" },
    .{ "hi", "ひ" },
    .{ "hu", "ふ" },
    .{ "he", "へ" },
    .{ "ho", "ほ" },

    .{ "ma", "ま" },
    .{ "mi", "み" },
    .{ "mu", "む" },
    .{ "me", "め" },
    .{ "mo", "も" },

    .{ "ya", "や" },
    .{ "yu", "ゆ" },
    .{ "yo", "よ" },

    .{ "ra", "ら" },
    .{ "ri", "り" },
    .{ "ru", "る" },
    .{ "re", "れ" },
    .{ "ro", "ろ" },

    .{ "wa", "わ" },
    .{ "wo", "を" },
    .{ "nn", "ん" },

    // Voiced consonants
    .{ "ga", "が" },
    .{ "gi", "ぎ" },
    .{ "gu", "ぐ" },
    .{ "ge", "げ" },
    .{ "go", "ご" },

    .{ "za", "ざ" },
    .{ "zi", "じ" },
    .{ "zu", "ず" },
    .{ "ze", "ぜ" },
    .{ "zo", "ぞ" },

    .{ "da", "だ" },
    .{ "di", "ぢ" },
    .{ "du", "づ" },
    .{ "de", "で" },
    .{ "do", "ど" },

    .{ "ba", "ば" },
    .{ "bi", "び" },
    .{ "bu", "ぶ" },
    .{ "be", "べ" },
    .{ "bo", "ぼ" },

    .{ "pa", "ぱ" },
    .{ "pi", "ぴ" },
    .{ "pu", "ぷ" },
    .{ "pe", "ぺ" },
    .{ "po", "ぽ" },

    // Double consonants
    .{ "kya", "きゃ" },
    .{ "kyi", "きぃ"},
    .{ "kyu", "きゅ" },
    .{ "kye", "きぇ" },
    .{ "kyo", "きょ" },

    .{ "nya", "にゃ" },
    .{ "nyi", "にぃ" },
    .{ "nyu", "にゅ" },
    .{ "nye", "にぇ" },
    .{ "nyo", "にょ" },

    .{ "hya", "ひゃ" },
    .{ "hyi", "ひぃ" },
    .{ "hyu", "ひゅ" },
    .{ "hye", "ひぇ" },
    .{ "hyo", "ひょ" },

    .{ "mya", "みゃ" },
    .{ "myi", "みぃ" },
    .{ "myu", "みゅ" },
    .{ "mye", "みぇ" },
    .{ "myo", "みょ" },

    .{ "rya", "りゃ" },
    .{ "ryi", "りぃ" },
    .{ "ryu", "りゅ" },
    .{ "rye", "りぇ" },
    .{ "ryo", "りょ" },

    .{ "tya", "ちゃ" },
    .{ "tyi", "ちぃ" },
    .{ "tyu", "ちゅ" },
    .{ "tye", "ちぇ" },
    .{ "tyo", "ちょ" },

    .{ "cya", "ちゃ" },
    .{ "cyi", "ちぃ" },
    .{ "cyu", "ちゅ" },
    .{ "cye", "ちぇ" },
    .{ "cyo", "ちょ" },
    
    .{ "pya", "ぴゃ" },
    .{ "pyi", "ぴぃ" },
    .{ "pyu", "ぴゅ" },
    .{ "pye", "ぴぇ" },
    .{ "pyo", "ぴょ" },
    
    .{ "bya", "びゃ" },
    .{ "byi", "びぃ" },
    .{ "byu", "びゅ" },
    .{ "bye", "びぇ" },
    .{ "byo", "びょ" },

    .{ "tsa", "つぁ" },
    .{ "tsi", "つぃ" },
    .{ "tsu", "つ" },
    .{ "tse", "つぇ" },
    .{ "tso", "つぉ" },

    .{ "tha", "てゃ" },
    .{ "thi", "てぃ" },
    .{ "thu", "てゅ" },
    .{ "the", "てぇ" },
    .{ "tho", "てょ" },

    .{ "cha", "ちゃ" },
    .{ "chi", "ち" },
    .{ "chu", "ちゅ" },
    .{ "che", "ちぇ" },
    .{ "cho", "ちょ" },

    .{ "sha", "しゃ" },
    .{ "shi", "し" },
    .{ "shu", "しゅ" },
    .{ "she", "しぇ" },
    .{ "sho", "しょ" },

    .{ "kwa", "くぁ" },
    .{ "kwi", "くぃ" },
    .{ "kwu", "くぅ" },
    .{ "kwe", "くぇ" },
    .{ "kwo", "くぉ" },

    .{ "gwa", "ぐぁ" },
    .{ "gwi", "ぐぃ" },
    .{ "gwu", "ぐぅ" },
    .{ "gwe", "ぐぇ" },
    .{ "gwo", "ぐぉ" },

    .{ "swa", "すぁ" },
    .{ "swi", "すぃ" },
    .{ "swu", "すぅ" },
    .{ "swe", "すぇ" },
    .{ "swo", "すぉ" },

    .{ "zwa", "ずぁ" },
    .{ "zwi", "ずぃ" },
    .{ "zwu", "ずぅ" },
    .{ "zwe", "ずぇ" },
    .{ "zwo", "ずぉ" },

    .{ "twa", "とぁ" },
    .{ "twi", "とぃ" },
    .{ "twu", "とぅ" },
    .{ "twe", "とぇ" },
    .{ "two", "とぉ" },

    .{ "dwa", "どぁ" },
    .{ "dwi", "どぃ" },
    .{ "dwu", "どぅ" },
    .{ "dwe", "どぇ" },
    .{ "dwo", "どぉ" },

    .{ "qa", "くぁ" },
    .{ "qi", "くぃ" },
    .{ "qu", "く" },
    .{ "qe", "くぇ" },
    .{ "qo", "くぉ" },

    .{ "ja", "じゃ" },
    .{ "ji", "じ" },
    .{ "ju", "じゅ" },
    .{ "je", "じぇ" },
    .{ "jo", "じょ" },

    .{ "va", "ゔぁ" },
    .{ "vi", "ゔぃ" },
    .{ "vu", "ゔ" },
    .{ "ve", "ゔぇ" },
    .{ "vo", "ゔぉ" },

    .{ "wi", "うぃ" },
    .{ "wu", "う" },
    .{ "we", "うぇ" },

    .{ "ye", "いぇ" },

    // small kana 'x'
    .{ "xtsu", "っ" },

    .{ "xke", "ヶ" },
    .{ "xka", "ヵ" },

    .{ "xa", "ぁ" },
    .{ "xi", "ぃ" },
    .{ "xu", "ぅ" },
    .{ "xe", "ぇ" },
    .{ "xo", "ぉ" },

    .{ "xya", "ゃ" },
    .{ "xyi", "ぃ" },
    .{ "xyu", "ゅ" },
    .{ "xye", "ぇ" },
    .{ "xyo", "ょ" },

    // small kana with 'l'
    .{ "ltsu", "っ" },

    .{ "lke", "ヶ" },
    .{ "lka", "ヵ" },

    .{ "la", "ぁ" },
    .{ "li", "ぃ" },
    .{ "lu", "ぅ" },
    .{ "le", "ぇ" },
    .{ "lo", "ぉ" },

    .{ "lya", "ゃ" },
    .{ "lyi", "ぃ" },
    .{ "lyu", "ゅ" },
    .{ "lye", "ぇ" },
    .{ "lyo", "ょ" },

    // small tsu with repetition
    // for all consonants
    .{ "kk", "っ" },
    .{ "ss", "っ" },
    .{ "tt", "っ" },
    .{ "pp", "っ" },
    .{ "bb", "っ" },
    .{ "dd", "っ" },
    .{ "ff", "っ" },
    .{ "gg", "っ" },
    .{ "hh", "っ" },
    .{ "jj", "っ" },
    .{ "kk", "っ" },
    .{ "ll", "っ" },
    .{ "xx", "っ" },
    .{ "zz", "っ" },
    .{ "cc", "っ" },
});